In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [6]:
df = pd.DataFrame(randn(4,3), ["A", "B", "C", "D"], ["Column1", "Column2", "Column3"])

In [7]:
df

    Column1   Column2   Column3
A  1.111544 -0.324067  0.692160
B  0.063296  1.812797 -0.914431
C  0.173107 -0.039859 -0.794974
D -0.425521 -1.228637 -1.279751

In [8]:
df > -1

   Column1  Column2  Column3
A     True     True     True
B     True     True     True
C     True     True     True
D     True    False    False

In [9]:
df >0

   Column1  Column2  Column3
A     True    False     True
B     True     True    False
C     True    False    False
D    False    False    False

In [10]:
booleanDf = df >0

In [11]:
booleanDf

   Column1  Column2  Column3
A     True    False     True
B     True     True    False
C     True    False    False
D    False    False    False

In [13]:
df[booleanDf] #false olanlar NaN

    Column1   Column2  Column3
A  1.111544       NaN  0.69216
B  0.063296  1.812797      NaN
C  0.173107       NaN      NaN
D       NaN       NaN      NaN

In [14]:
df[df>0]

    Column1   Column2  Column3
A  1.111544       NaN  0.69216
B  0.063296  1.812797      NaN
C  0.173107       NaN      NaN
D       NaN       NaN      NaN

In [15]:
df

    Column1   Column2   Column3
A  1.111544 -0.324067  0.692160
B  0.063296  1.812797 -0.914431
C  0.173107 -0.039859 -0.794974
D -0.425521 -1.228637 -1.279751

In [16]:
df["Column1"]

A    1.111544
B    0.063296
C    0.173107
D   -0.425521
Name: Column1, dtype: float64

In [17]:
df["Column1"] > 0

A     True
B     True
C     True
D    False
Name: Column1, dtype: bool

In [18]:
df[df["Column1"] > 0]

    Column1   Column2   Column3
A  1.111544 -0.324067  0.692160
B  0.063296  1.812797 -0.914431
C  0.173107 -0.039859 -0.794974

In [19]:
df[df["Column1"] > 0.6]

    Column1   Column2  Column3
A  1.111544 -0.324067  0.69216

In [20]:
df["Column1"] > 0.5

A     True
B    False
C    False
D    False
Name: Column1, dtype: bool

In [21]:
df[df["Column1"] > 0.5]

    Column1   Column2  Column3
A  1.111544 -0.324067  0.69216

In [22]:
df[df["Column1"] > 0]

    Column1   Column2   Column3
A  1.111544 -0.324067  0.692160
B  0.063296  1.812797 -0.914431
C  0.173107 -0.039859 -0.794974

In [23]:
df[df["Column2"] > 0.5]

    Column1   Column2   Column3
B  0.063296  1.812797 -0.914431

In [24]:
df[(df["Column1"] > 0) & (df["Column2"] > 0.5)]

    Column1   Column2   Column3
B  0.063296  1.812797 -0.914431

In [27]:
df[(df["Column1"] > 0) | (df["Column2"] > 0.5)] # dik çizgi or anlamına geliyor.

    Column1   Column2   Column3
A  1.111544 -0.324067  0.692160
B  0.063296  1.812797 -0.914431
C  0.173107 -0.039859 -0.794974

In [28]:
df

    Column1   Column2   Column3
A  1.111544 -0.324067  0.692160
B  0.063296  1.812797 -0.914431
C  0.173107 -0.039859 -0.794974
D -0.425521 -1.228637 -1.279751

In [29]:
df["Column4"] = pd.Series(randn(4),["A","B","C","D"])

In [31]:
df

    Column1   Column2   Column3   Column4
A  1.111544 -0.324067  0.692160 -0.005186
B  0.063296  1.812797 -0.914431 -0.061861
C  0.173107 -0.039859 -0.794974 -0.616051
D -0.425521 -1.228637 -1.279751 -1.200882

In [33]:
df["Column5"] = randn(4)

In [34]:
df

    Column1   Column2   Column3   Column4   Column5
A  1.111544 -0.324067  0.692160 -0.005186 -1.106927
B  0.063296  1.812797 -0.914431 -0.061861 -0.739057
C  0.173107 -0.039859 -0.794974 -0.616051  2.274646
D -0.425521 -1.228637 -1.279751 -1.200882 -1.394217

In [35]:
df["Column6"] = ["newValue1", "newValue2", "newValue3", "newValue4"]

In [36]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  1.111544 -0.324067  0.692160 -0.005186 -1.106927  newValue1
B  0.063296  1.812797 -0.914431 -0.061861 -0.739057  newValue2
C  0.173107 -0.039859 -0.794974 -0.616051  2.274646  newValue3
D -0.425521 -1.228637 -1.279751 -1.200882 -1.394217  newValue4

In [37]:
df.set_index("Column6")

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  1.111544 -0.324067  0.692160 -0.005186 -1.106927
newValue2  0.063296  1.812797 -0.914431 -0.061861 -0.739057
newValue3  0.173107 -0.039859 -0.794974 -0.616051  2.274646
newValue4 -0.425521 -1.228637 -1.279751 -1.200882 -1.394217

In [39]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  1.111544 -0.324067  0.692160 -0.005186 -1.106927  newValue1
B  0.063296  1.812797 -0.914431 -0.061861 -0.739057  newValue2
C  0.173107 -0.039859 -0.794974 -0.616051  2.274646  newValue3
D -0.425521 -1.228637 -1.279751 -1.200882 -1.394217  newValue4

In [40]:
df.set_index("Column6", inplace=True)

In [41]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  1.111544 -0.324067  0.692160 -0.005186 -1.106927
newValue2  0.063296  1.812797 -0.914431 -0.061861 -0.739057
newValue3  0.173107 -0.039859 -0.794974 -0.616051  2.274646
newValue4 -0.425521 -1.228637 -1.279751 -1.200882 -1.394217

In [42]:
df.index.names

FrozenList(['Column6'])